Tekla Open API Reference for Tekla Structures 2025
FormBase.InitializeForm Method
 Prepares the data storage for the dialog and scans through the fields.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void InitializeForm()
Public Sub InitializeForm
See Also
Reference
FormBase Class
Tekla.Structures.Dialog Namespace